# AddLoadClassification Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleData..::..AddLoadClassification Method
PanelScheduleData Class See Also
---
Add a Load Classification Id to the array of Load Classifications.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool AddLoadClassification(
	ElementId loadClassficationId
)
```

Visual Basic
---
```text
Public Function AddLoadClassification ( _
	loadClassficationId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool AddLoadClassification(
	ElementId^ loadClassficationId
)
```

# ### Parameters
loadClassficationId
    Type: Autodesk.Revit.DB..::..ElementId The load classification to add
# ### Return Value
True if success; false if the given Id has already existed.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace